aadabathon/PSoC6AI-workingDir/source/main.c
    return 0;
}

/*******************************************************************************
* Function Name: reconf_radar
********************************************************************************
* Summary:
* This is the function for radar reconfiguration
*
* Parameters:
*  requested: Choosed configuration
*
* Return:
*  void
*
*******************************************************************************/
void reconf_radar(optimization_type_e requested)
{
    if (requested == CONFIG_UNINITIALIZED)
    {
        return;
    }

    if (xensiv_bgt60trxx_config(&bgt60_obj.dev,
            optimizations_list[requested].reg_list,
            optimizations_list[requested].reg_list_size) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx reconfiguration failed\n");
        CY_ASSERT(0);
    }

    if (xensiv_bgt60trxx_set_fifo_limit(&bgt60_obj.dev,
            optimizations_list[requested].fifo_limit) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx set fifo limit failed\n");
        CY_ASSERT(0);
    }

    if (xensiv_bgt60trxx_start_frame(&bgt60_obj.dev, true) != CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: xensiv_bgt60trxx_start_frame failed\n");
        CY_ASSERT(0);
    }
}


/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
* This is the main function for CM4 CPU. It initializes BSP, creates FreeRTOS
* main task and starts the scheduler.
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;

    /* Initialize the device and board peripherals */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize retarget-io to use the debug UART port */
    cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);

#ifdef TARGET_APP_CYSBSYSKIT_DEV_01

    /* Initialize the User LED */
    cyhal_gpio_init(CYBSP_USER_LED, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, CYBSP_LED_STATE_OFF);

#endif

    mgr.in_read_radar_data = read_radar_data;
    radar_data_manager_init(&mgr, NUM_SAMPLES_PER_FRAME *6, NUM_SAMPLES_PER_FRAME *2);
    radar_data_manager_set_malloc_free(pvPortMalloc,
            vPortFree);

    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
    printf("\x1b[2J\x1b[;H");
    printf("****************** "
           "Radar presence"
           "****************** \r\n\n"
           "Human presence detection using XENSIV 60-GHz radar\r\n"
           );
    printf("Press ENTER to enter setup mode, press ESC to quit setup mode \r\n");

    /* Create the RTOS task */
    if (xTaskCreate(main_task, MAIN_TASK_NAME, MAIN_TASK_STACK_SIZE, NULL, MAIN_TASK_PRIORITY, &main_task_handler) != pdPASS)
    {
        CY_ASSERT(0);
    }

    /* Start the FreeRTOS scheduler. */
    vTaskStartScheduler();

    CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: main_task
********************************************************************************
* Summary:
* This is the main task.
*    1. Creates a timer to toggle user LED
*    2. Create the processing RTOS task
*    3. Initializes the hardware interface to the sensor and LEDs
*    4. Initializes the radar device
*    5. In an infinite loop
*       - Waits for interrupt from radar device indicating availability of data
*       - Reads the data, converts it to floating point and notifies the processing task
* Parameters:
*  void
*
* Return:
*  none
*
*******************************************************************************/
static __NO_RETURN void main_task(void *pvParameters)
{
    (void)pvParameters;
    uint32_t sz;
    uint16_t *data_buff = NULL;
    cy_rslt_t result;
    XENSIV_RADAR_PRESENCE_TIMESTAMP last_timestamp = 0;

    logger_init();
    logger_set_mode(LOG_MODE_HUMAN);
    timer_handler = xTimerCreate("timer", pdMS_TO_TICKS(1000), pdTRUE, NULL, timer_callbak);    
    if (timer_handler == NULL)
    {
        CY_ASSERT(0);
    }

    if (xTimerStart(timer_handler, 0) != pdPASS)
    {
        CY_ASSERT(0);
    }

    if (xTaskCreate(processing_task, PROCESSING_TASK_NAME, PROCESSING_TASK_STACK_SIZE, NULL, PROCESSING_TASK_PRIORITY, &processing_task_handler) != pdPASS)
    {
        CY_ASSERT(0);
    }

    if (init_sensor() != 0)
    {
        CY_ASSERT(0);
    }

    if (init_leds () != 0)
    {
        CY_ASSERT(0);
    }

    /* ---- 9-DOF I2C sensor stack (DPS368 + BMI270 + BMM350) ---- */
    if (i2c_bus_init() == CY_RSLT_SUCCESS)
        {
            //barometer_task_init();
            vTaskDelay(pdMS_TO_TICKS(150));
            //imu_task_init();
            vTaskDelay(pdMS_TO_TICKS(750));   // ← more time before mag; BMM350 init is slow
            //mag_task_init();
            vTaskDelay(pdMS_TO_TICKS(500));
            //mic_task_init();
            printf("[sensors] 9-DOF I2C stack online\r\n");
        }
    else
        {
            printf("[sensors] i2c_bus_init FAILED\r\n");
        }
        
    /* ----------------------------------------------------------- */
    /* ---- QSPI flash bring-up: erase, write, read-back, verify ---- */
    if (qspi_flash_init() == CY_RSLT_SUCCESS)
    {
        printf("[qspi] flash up: %lu bytes, %lu-byte sectors\r\n",
               (unsigned long)qspi_flash_total_size(),
               (unsigned long)qspi_flash_sector_size());

        const uint32_t test_addr = 0x0;
        uint8_t  wbuf[16] = {0xDE,0xAD,0xBE,0xEF,0x01,0x02,0x03,0x04,
                             0x05,0x06,0x07,0x08,0xCA,0xFE,0xBA,0xBE};
        uint8_t  rbuf[16] = {0};

        qspi_flash_erase(test_addr, qspi_flash_sector_size());  /* erase before write */
        qspi_flash_write(test_addr, wbuf, sizeof(wbuf));
        qspi_flash_read (test_addr, rbuf, sizeof(rbuf));

        bool ok = (memcmp(wbuf, rbuf, sizeof(wbuf)) == 0);
        printf("[qspi] round-trip %s (read back %02X %02X %02X %02X ...)\r\n",
               ok ? "PASS" : "FAIL", rbuf[0], rbuf[1], rbuf[2], rbuf[3]);
    }
    else
    {
        printf("[qspi] flash init FAILED\r\n");
    }
    /* -------------------------------------------------------------- */


    mgr.subscribe(main_task_handler);

    /* Initialize the initial state of ce_app_state */
    ce_app_state.last_reported_event.state = XENSIV_RADAR_PRESENCE_STATE_ABSENCE;
    ce_app_state.last_reported_event.range_bin = 0;
    ce_app_state.last_reported_event.timestamp = 0;

    if (xensiv_bgt60trxx_start_frame(&bgt60_obj.dev, true) != XENSIV_BGT60TRXX_STATUS_OK)
    {
        CY_ASSERT(0);
    }

    for(;;)
    {
        /* Wait for the GPIO interrupt to indicate that another slice is available */
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        mgr.read_from_buffer(1, &data_buff, &sz);

